/**
 * File:   %<%NAME%>%.%<%EXTENSION%>%
 * Author: %<%USER%>%
 *
 * Created on %<%DATE%>%, %<%TIME%>%
 */

#ifndef LIB_A_NINTEG_NUMERICAL_INTEGRATION_H
#define	LIB_A_NINTEG_NUMERICAL_INTEGRATION_H

/******************************************************************************/
//  Секция include (подключаем заголовочные файлы используемых модулей)
/*============================================================================*/
//  Стандартные библиотеки языка С
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <math.h>
/*============================================================================*/


/*============================================================================*/
//  Библиотеки для работы с периферией микроконтроллера
/*============================================================================*/


/*============================================================================*/
//  Внешние модули
/*============================================================================*/
/******************************************************************************/


/******************************************************************************/
//  Секция определения констант
/******************************************************************************/


/******************************************************************************/
//  Секция определения типов

typedef struct {
    float anglVelocity;
    float dT;
    size_t integrateTacktFlag;
} NINTEG_data_for_integrate_s;

typedef struct {
    /**
     * @brief   Интегрированное значение;
     */
    float integratedata;

    /**
     * @brief   Период интегрирования в секундах;
     */
    float dT;

    /**
     * @brief   Данные для интегрирования, которые были получены в предыдущем
     *          вызове функции интегрирования:
     */
    float previousData;
} NINTEG_trapezium_integrate_s;
/******************************************************************************/


/******************************************************************************/
//  Секция определения глобальных переменных
/******************************************************************************/


/******************************************************************************/
//  Секция прототипов глобальных функций
extern float NINTEG_IntegrateAnglVelocityTrapezium(float *pPreviousAngleVelocity,
        float *pCurrentAngleVelocity,
        float deltaTimeInSec);
extern void NINTEG_IntegrateAngleVelocityTrapeziumAllAxis(float *pPreviousAngleVelocityArr,
        float *pCurrentAngleVelocityArr,
        float deltaTimeInSec,
        float *pDeltaAngelsArr);

extern float NINTEG_IntegrateTrapezium(
        AVI_trapezium_integrate_s *pStruct,
        float data);
/******************************************************************************/


/******************************************************************************/
//  Секция определения макросов
/******************************************************************************/

#endif	/* LIB_A_NINTEG_NUMERICAL_INTEGRATION_H */

////////////////////////////////////////////////////////////////////////////////
//  END OF FILE
////////////////////////////////////////////////////////////////////////////////